# ğŸ‘€ Pandas Cheatsheet

In [139]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

import warnings
warnings.filterwarnings("ignore")

## 1. Pandas
êµ¬ì¡°í™”ëœ ë°ì´í„°ì˜ ì²˜ë¦¬ë¥¼ ì§€ì›í•˜ëŠ” Python ë¼ì´ë¸ŒëŸ¬ë¦¬ë¡œ ì£¼ë¡œ ë°ì´í„° ì²˜ë¦¬ ë° í†µê³„ ë¶„ì„ì„ ìœ„í•´ ì‚¬ìš©í•œë‹¤.

### 1.1. Terminology

![ìš©ì–´](./img/terminology.png)

## 2. Data Load
### 2.1. read_csv

In [2]:
data_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/housing/housing.data'
# CSV ë°ì´í„° ë¡œë“œ, êµ¬ë¶„ìëŠ” ì—°ì†ëœ ê³µë°±, ì»¬ëŸ¼ì€ ì—†ìŒ
df = pd.read_csv(data_url, sep='\s+', header=None)
# ì²˜ìŒ ë‹¤ì„¯ì¤„ ì¶œë ¥
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

`data_columns`ë¡œ **ì»¬ëŸ¼ ì´ë¦„ ì§€ì •**ë„ ê°€ëŠ¥í•˜ë‹¤.

In [3]:
df.data_columns =  ["CRIM", "ZN", "INDUS", "CHAS", "NOX", "RM", "AGE", "DIS", "RAD", "TAX", "PTRATIO", "B", "LSTAT", "MEDV"]
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

## 3. Series
ë°ì´í„°í”„ë ˆì„ ì¤‘ **í•˜ë‚˜ì˜ ì»¬ëŸ¼**ì— í•´ë‹¹í•˜ëŠ” ë°ì´í„° ê°ì²´
- `numpy.ndarray`ì˜ ì„œë¸Œ í´ë˜ìŠ¤ì´ë‹¤.
- ë°ì´í„° íƒ€ì…ì€ ëª¨ë“  ìë£Œí˜• ì‚¬ìš© ê°€ëŠ¥í•˜ë‹¤.
- ì¸ë±ìŠ¤ ë¼ë²¨ì€ ì •ë ¬í•  í•„ìš”ê°€ ì—†ë‹¤.
- ì¤‘ë³µì´ ê°€ëŠ¥í•˜ë‹¤.

### 3.1. Series ìƒì„±

#### 3.1.1. ë¦¬ìŠ¤íŠ¸

In [4]:
# ë¦¬ìŠ¤íŠ¸ë¡œ ë°ì´í„° ìƒì„±
list_data = [1, 2, 3, 4, 5]
example_obj = pd.Series(data=list_data)
example_obj

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
# ë¦¬ìŠ¤íŠ¸ë¡œ ì¸ë±ìŠ¤ì™€ ë°ì´í„° ë¦¬ìŠ¤íŠ¸ë¥¼ ë”°ë¡œ ë§Œë“¤ì–´ ì§€ì • ê°€ëŠ¥
list_data = [1, 2, 3, 4, 5]
list_name = ["a", "b", "c", "d", "e"]
example_obj = pd.Series(data=list_data, index=list_name)
example_obj

a    1
b    2
c    3
d    4
e    5
dtype: int64

#### 3.1.2. ë”•ì…”ë„ˆë¦¬

In [6]:
# ë”•ì…”ë„ˆë¦¬ë¡œ ì¸ë±ìŠ¤ë¥¼ ì§€ì •í•˜ì—¬ ë°ì´í„° ìƒì„±
dict_data = {"a": 1, "b": 2, "c": 3, "d": 4, "e": 5}
# dtypeìœ¼ë¡œ ìë£Œí˜• ì§€ì •, nameìœ¼ë¡œ Seriesì˜ ì´ë¦„ ì§€ì •
example_obj = pd.Series(dict_data, dtype=np.int16, name="exmaple_obj")
example_obj

a    1
b    2
c    3
d    4
e    5
Name: exmaple_obj, dtype: int16

In [7]:
# ë‹¤ì‹œ dictë¡œ ë³€í™˜ ê°€ëŠ¥
example_obj.to_dict()

{'a': 1, 'b': 2, 'c': 3, 'd': 4, 'e': 5}

In [8]:
# í•­ìƒ ì¸ë±ìŠ¤ë¥¼ ê¸°ì¤€ìœ¼ë¡œ Seriesë¥¼ ìƒì„±
dict_data_2 = {"a": 1, "b": 2, "c": 3, "d": 4, "e": 5}
indexes = ["a", "b", "c", "d", "e", "f", "g", "h"]
example_obj_2 = pd.Series(dict_data_2, index=indexes)
example_obj_2

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
f    NaN
g    NaN
h    NaN
dtype: float64

### 3.2. Seriesì˜ ì†ì„±

#### 3.2.1. name - í…Œì´ë¸” ì´ë¦„

In [9]:
example_obj.name = "series name what?"
example_obj

a    1
b    2
c    3
d    4
e    5
Name: series name what?, dtype: int16

#### 3.2.2. index - ì¸ë±ìŠ¤ ê°ì²´

In [10]:
# Seriesì˜ ì¸ë±ìŠ¤ ê°ì²´ë°˜í™˜
example_obj.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [11]:
# ì¸ë±ìŠ¤ì˜ ì´ë¦„ë„ ì„¤ì • ê°€ëŠ¥
example_obj.index.name = "index name what?"
example_obj

index name what?
a    1
b    2
c    3
d    4
e    5
Name: series name what?, dtype: int16

#### 3.2.3. values

In [12]:
# Seriesì˜ ë°ì´í„°(value)ë¥¼ ë°˜í™˜í•˜ë©° ìë£Œí˜•ì€ numpy.ndarray
print("series.valuesì˜ ìë£Œí˜• :", type(example_obj.values))
example_obj.values

series.valuesì˜ ìë£Œí˜• : <class 'numpy.ndarray'>

array([1, 2, 3, 4, 5], dtype=int16)

### 3.3. Seriesì™€ in ì—°ì‚°ì

In [13]:
# Index(Key) ê°’ ì—¬ë¶€ë¥¼ í™•ì¸
print("b exists?", "b" in example_obj)
print("z exists?", "z" in example_obj)

b exists? True
z exists? False

### 3.4. Seriesì˜ ë°ì´í„° ì ‘ê·¼

In [14]:
# Index ì¸ë±ì‹±ìœ¼ë¡œ ì ‘ê·¼ ê°€ëŠ¥
example_obj["a"]

1

In [15]:
# ì ‘ê·¼í•œ ì¸ë±ìŠ¤ì— ê°’ í• ë‹¹ ê°€ëŠ¥
example_obj["a"] = 10
example_obj

index name what?
a    10
b     2
c     3
d     4
e     5
Name: series name what?, dtype: int16

### 3.5. astype - ìë£Œí˜• ì§€ì •

In [16]:
# ë°ì´í„°ì˜ ìë£Œí˜• ë³€ê²½
# ì €ì¥ì‹œ ë‹¤ì‹œ í• ë‹¹í•´ì¤˜ì•¼ í•œë‹¤
example_obj = example_obj.astype(np.float64)
example_obj

index name what?
a    10.0
b     2.0
c     3.0
d     4.0
e     5.0
Name: series name what?, dtype: float64

In [17]:
example_obj

index name what?
a    10.0
b     2.0
c     3.0
d     4.0
e     5.0
Name: series name what?, dtype: float64

## 4. Dataframe
ë°ì´í„° í…Œì´ë¸” ì „ì²´ë¥¼ í¬í•¨í•˜ëŠ” ê°ì²´
- `numpy` ë°°ì—´ê³¼ ë¹„ìŠ·í•˜ë‹¤.
- ê° ì»¬ëŸ¼ì´ ê°ì ë‹¤ë¥¸ ìë£Œí˜•ì„ ê°€ì§€ê³  ìˆë‹¤.
- í–‰ê³¼ ì—´ì— ê°ê° ì¸ë±ìŠ¤ê°€ ìˆë‹¤.
- ì»¬ëŸ¼ì€ ì‚½ì…í•˜ê³  ì‚­ì œí•˜ë©´ì„œ í¬ê¸°ë¥¼ ì¡°ì ˆí•  ìˆ˜ ìˆë‹¤.

### 4.1. Dataframe ìƒì„±

In [18]:
# ì¶œì²˜: https://chrisalbon.com/python/pandas_map_values_to_values.html
raw_data = {
    "first_name": ["Jason", "Molly", "Tina", "Jake", "Amy"],
    "last_name": ["Miller", "Jacobson", "Ali", "Milner", "Cooze"],
    "age": [42, 52, 36, 24, 73],
    "city": ["San Francisco", "Baltimore", "Miami", "Douglas", "Boston"],
}

In [19]:
# ë”•ì…”ë„ˆë¦¬ì˜ keyê°’ì— ëŒ€ì‘í•´ì„œ DataFrame ìƒì„±
column_names1 = ["first_name", "last_name", "age", "city"]
df = pd.DataFrame(raw_data, columns=column_names1)
df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [20]:
# ì¼ë¶€ë§Œ ê°€ì ¸ì™€ì„œ ìƒì„± ê°€ëŠ¥
column_names2 = ["age", "city"]
pd.DataFrame(raw_data, columns=column_names2)

   age           city
0   42  San Francisco
1   52      Baltimore
2   36          Miami
3   24        Douglas
4   73         Boston

In [21]:
# ë”•ì…”ë„ˆë¦¬ì— ì—†ëŠ” ê°’ì´ë©´ ìƒˆë¡œìš´ ì»¬ëŸ¼ì„ ìƒì„±í•˜ê³  NaNìœ¼ë¡œ ì±„ì›€
column_names3 = ["first_name", "last_name", "age", "city", "debt"]
pd.DataFrame(raw_data, columns=column_names3)

  first_name last_name  age           city debt
0      Jason    Miller   42  San Francisco  NaN
1      Molly  Jacobson   52      Baltimore  NaN
2       Tina       Ali   36          Miami  NaN
3       Jake    Milner   24        Douglas  NaN
4        Amy     Cooze   73         Boston  NaN

### 4.2. DataFrameì˜ ì»¬ëŸ¼ ì„ íƒ

In [22]:
# ë°©ë²• 1. ì¸ë±ì‹±
df["first_name"]

0    Jason
1    Molly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

In [23]:
# ë°©ë²• 2. ê°ì²´ ì†ì„± "."ìœ¼ë¡œ ì ‘ê·¼
df.first_name

0    Jason
1    Molly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

### 4.4. Dataframe ì¸ë±ì‹±

#### 4.4.1. loc - ëª…ì¹­ ê¸°ë°˜ ì¸ë±ì‹±

In [24]:
# loc[ì¶”ì¶œí•˜ë ¤ëŠ” ì¸ë±ìŠ¤ ë¦¬ìŠ¤íŠ¸, ì¶”ì¶œí•˜ë ¤ëŠ” ì»¬ëŸ¼ì´ë¦„ ë¦¬ìŠ¤íŠ¸]
df.loc[[0, 1, 2], ["first_name", "last_name"]]

  first_name last_name
0      Jason    Miller
1      Molly  Jacobson
2       Tina       Ali

In [25]:
# ì»¬ëŸ¼ ì¸ë±ìŠ¤ì— ì»¬ëŸ¼ ì´ë¦„ ë¬¸ìì—´ë§Œ ì˜¤ë©´ Seriesë¥¼ ë°˜í™˜
print("ìë£Œí˜• :", type(df.loc[:, "last_name"]))
df.loc[:, "last_name"]

ìë£Œí˜• : <class 'pandas.core.series.Series'>

0      Miller
1    Jacobson
2         Ali
3      Milner
4       Cooze
Name: last_name, dtype: object

In [26]:
# ì»¬ëŸ¼ ì¸ë±ìŠ¤ì— ì»¬ëŸ¼ ì´ë¦„ìœ¼ë¡œ ì´ë£¨ì–´ì§„ ë¦¬ìŠ¤íŠ¸ê°€ ì˜¤ë©´ DataFrameì„ ë°˜í™˜
print("ìë£Œí˜• :", type(df.loc[:, ["last_name"]]))
df.loc[:, ["last_name"]]

ìë£Œí˜• : <class 'pandas.core.frame.DataFrame'>

  last_name
0    Miller
1  Jacobson
2       Ali
3    Milner
4     Cooze

#### 4.4.2. iloc - ìœ„ì¹˜ ê¸°ë°˜ ì¸ë±ì‹±

In [27]:
# iloc[ì¸ë±ìŠ¤ ì¸ë±ì‹±/ìŠ¬ë¼ì´ì‹±, ì»¬ëŸ¼ ìœ„ì¹˜ ì¸ë±ì‹±/ìŠ¬ë¼ì´ì‹±]
df.iloc[:2, :2]

  first_name last_name
0      Jason    Miller
1      Molly  Jacobson

In [28]:
# ì»¬ëŸ¼ì„ ìˆ«ìë¡œ ì§€ì •í•˜ì—¬ ì ‘ê·¼
# ì»¬ëŸ¼ ì¸ë±ìŠ¤ì— ì •ìˆ˜ë§Œ ë“¤ì–´ê°ˆ ê²½ìš° Seriesë¥¼ ë°˜í™˜
df.iloc[:, 1]

0      Miller
1    Jacobson
2         Ali
3      Milner
4       Cooze
Name: last_name, dtype: object

In [29]:
# ì»¬ëŸ¼ ì¸ë±ìŠ¤ì— ì •ìˆ˜ ë¦¬ìŠ¤íŠ¸ê°€ ì˜¤ë©´ DataFrameì„ ë°˜í™˜
df.iloc[:, 1:3]

  last_name  age
0    Miller   42
1  Jacobson   52
2       Ali   36
3    Milner   24
4     Cooze   73

In [30]:
# ì»¬ëŸ¼ì„ ì¶”ì¶œí•´ì„œ ì¸ë±ìŠ¤ì— ì ‘ê·¼ ê°€ëŠ¥
df["age"].iloc[1:]

1    52
2    36
3    24
4    73
Name: age, dtype: int64

### 4.2.3. locì™€ iloc ì°¨ì´

In [31]:
# ì¶œì²˜: https://stackoverflow.com/questions/31593201/pandas-iloc-vs-ix-vs-loc-explanation
df_loc_iloc = pd.Series(np.nan, index=[49, 48, 47, 46, 45, 1, 2, 3, 4, 5])
df_loc_iloc

49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
1    NaN
2    NaN
3    NaN
4    NaN
5    NaN
dtype: float64

`loc`ëŠ” ëª…ì¹­ ê¸°ë°˜ ì¸ë±ìŠ¤ì´ë¯€ë¡œ ìˆ«ì ì •ë ¬ê³¼ ìƒê´€ì—†ì´ **ì¸ë±ìŠ¤ì¸ 3ê¹Œì§€ ì¶”ì¶œ**í•œë‹¤. ì¸ë±ìŠ¤ê°€ ë¬¸ìì—´ì´ì–´ë„ ê°€ëŠ¥í•˜ë‹¤.

In [32]:
df_loc_iloc.loc[:3]

49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
1    NaN
2    NaN
3    NaN
dtype: float64

`iloc`ëŠ” ìœ„ì¹˜ ê¸°ë°˜ ì¸ë±ìŠ¤ì´ë¯€ë¡œ Seriesì˜ ì¸ë±ìŠ¤ì™€ ìƒê´€ ì—†ì´ ìœ„ì—ì„œ 0, 1, 2, ... ë¡œ ìˆœì„œë¥¼ ë§¤ê¸¸ ë•Œ 3ë²ˆì§¸ê¹Œì§€ë¥¼ ì¶”ì¶œí•œë‹¤.

In [33]:
df_loc_iloc.iloc[:3]

49   NaN
48   NaN
47   NaN
dtype: float64

## 5. Boolean Indexing

In [34]:
# ê° ë°ì´í„°ì˜ ê¸°ë³¸ì—°ì‚°ì ê²°ê³¼ë¥¼ Seriesë¥¼ ë¬¶ì–´ì„œ ë°˜í™˜
df.age > 40

0     True
1     True
2    False
3    False
4     True
Name: age, dtype: bool

## 6. Dataframe Handling

### 6.1. ìƒˆë¡œìš´ ì»¬ëŸ¼ ì¶”ê°€

In [35]:
# Seriesë¡œ ìƒˆë¡œìš´ ì»¬ëŸ¼ ì¶”ê°€
# ë°ì´í„°ê°€ ì—†ëŠ” ê²½ìš° NaN ê°’ìœ¼ë¡œ ì±„ìš´ë‹¤
new_values = pd.Series(data=["M", "F", "F"], index=[0, 1, 3])
df["gender"] = new_values
df

  first_name last_name  age           city gender
0      Jason    Miller   42  San Francisco      M
1      Molly  Jacobson   52      Baltimore      F
2       Tina       Ali   36          Miami    NaN
3       Jake    Milner   24        Douglas      F
4        Amy     Cooze   73         Boston    NaN

In [36]:
# ë¶ˆë¦¬ì–¸ìœ¼ë¡œ ì´ë£¨ì–´ì§„ Seriesì˜ ê°’ìœ¼ë¡œ ì´ë£¨ì–´ì§„ ìƒˆë¡œìš´ ì»¬ëŸ¼ ì¶”ê°€
df["is_old"] = df.age > 40
df

  first_name last_name  age           city gender  is_old
0      Jason    Miller   42  San Francisco      M    True
1      Molly  Jacobson   52      Baltimore      F    True
2       Tina       Ali   36          Miami    NaN   False
3       Jake    Milner   24        Douglas      F   False
4        Amy     Cooze   73         Boston    NaN    True

In [37]:
# ë¦¬ìŠ¤íŠ¸ë„ ê°€ëŠ¥í•˜ì§€ë§Œ ë°ì´í„° ê°œìˆ˜ì™€ ë¦¬ìŠ¤íŠ¸ì˜ ê¸¸ì´ê°€ ë™ì¼í•´ì•¼ í•œë‹¤
df["height"] = [160, 180, 170, 175, 150]
df

  first_name last_name  age           city gender  is_old  height
0      Jason    Miller   42  San Francisco      M    True     160
1      Molly  Jacobson   52      Baltimore      F    True     180
2       Tina       Ali   36          Miami    NaN   False     170
3       Jake    Milner   24        Douglas      F   False     175
4        Amy     Cooze   73         Boston    NaN    True     150

In [38]:
# ndarrayë„ ê°€ëŠ¥í•˜ë©° ë¦¬ìŠ¤íŠ¸ì²˜ëŸ¼ ë°ì´í„° ê°œìˆ˜ë§Œí¼ì˜ ê°’ì´ ìˆì–´ì•¼ í•œë‹¤
df["weight"] = np.array([50, 60, 70, 65, 55])
df

  first_name last_name  age           city gender  is_old  height  weight
0      Jason    Miller   42  San Francisco      M    True     160      50
1      Molly  Jacobson   52      Baltimore      F    True     180      60
2       Tina       Ali   36          Miami    NaN   False     170      70
3       Jake    Milner   24        Douglas      F   False     175      65
4        Amy     Cooze   73         Boston    NaN    True     150      55

### 6.2. ì „ì¹˜ (transpose)

In [39]:
# ì»¬ëŸ¼ì´ ì˜¤ë¥¸ìª½ìœ¼ë¡œ ì˜¤ë©´ì„œ ì»¬ëŸ¼ì„ ì¢€ ë” ë³´ê¸° ì‰¬ì›€
df.T

                        0          1      2        3       4
first_name          Jason      Molly   Tina     Jake     Amy
last_name          Miller   Jacobson    Ali   Milner   Cooze
age                    42         52     36       24      73
city        San Francisco  Baltimore  Miami  Douglas  Boston
gender                  M          F    NaN        F     NaN
is_old               True       True  False    False    True
height                160        180    170      175     150
weight                 50         60     70       65      55

### 6.3. values

In [40]:
# ê°’ë§Œ ëª¨ì•„ì„œ 2ì°¨ì› ndarrayë¡œ ë°˜í™˜
df.values

array([['Jason', 'Miller', 42, 'San Francisco', 'M', True, 160, 50],
       ['Molly', 'Jacobson', 52, 'Baltimore', 'F', True, 180, 60],
       ['Tina', 'Ali', 36, 'Miami', nan, False, 170, 70],
       ['Jake', 'Milner', 24, 'Douglas', 'F', False, 175, 65],
       ['Amy', 'Cooze', 73, 'Boston', nan, True, 150, 55]], dtype=object)

### 6.4. index

In [41]:
# ì¸ë±ìŠ¤ë§Œ ë½‘ì•„ì„œ ë°˜í™˜
df.index

RangeIndex(start=0, stop=5, step=1)

### 6.5. to_csv - csvë¡œ ë³€í™˜

In [42]:
# csvë¡œ ë³€í™˜í•  ìˆ˜ ìˆìœ¼ë©°, pathë¥¼ ì§€ì •í•˜ë©´ ì €ì¥ì´ ê°€ëŠ¥
df.to_csv("./data/dataframe-practice.csv")

### 6.6. del

In [43]:
# del í‚¤ì›Œë“œë¡œ ì»¬ëŸ¼ ì‚­ì œ
del df["weight"]
df

  first_name last_name  age           city gender  is_old  height
0      Jason    Miller   42  San Francisco      M    True     160
1      Molly  Jacobson   52      Baltimore      F    True     180
2       Tina       Ali   36          Miami    NaN   False     170
3       Jake    Milner   24        Douglas      F   False     175
4        Amy     Cooze   73         Boston    NaN    True     150

## 7. Selection

In [44]:
# xlsxì€ xlrd < 2.0.0ì—ì„œë§Œ ì§€ì›
df = pd.read_excel("./data/excel-comp-data.xlsx")
df.head()

,account,name,street,city,state,postal-code,Jan,Feb,Mar
0,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

### 7.1. ì»¬ëŸ¼ ì´ë¦„ìœ¼ë¡œ ì„ íƒ

In [45]:
# 1ê°œ ì»¬ëŸ¼ ì„ íƒ ì‹œ Series ë°˜í™˜
df['account'].head()

0    211829
1    320563
2    648336
3    109996
4    121213
Name: account, dtype: int64

In [46]:
# ì—¬ëŸ¬ ì»¬ëŸ¼ ë¦¬ìŠ¤íŠ¸ë¡œ ì„ íƒ ì‹œ DataFrame ë°˜í™˜
df[["account", "street", "state"]].head()

   account                                street          state
0   211829                    34456 Sean Highway          Texas
1   320563                     1311 Alvis Tunnel  NorthCarolina
2   648336  62184 Schamberger Underpass Apt. 231           Iowa
3   109996           155 Fadel Crescent Apt. 144          Maine
4   121213                   7274 Marissa Common     California

### 7.2. ì¸ë±ìŠ¤ë¡œ ì„ íƒ

In [47]:
# ì„¸ë²ˆì§¸ ë°ì´í„°ê¹Œì§€ë§Œ ì¶”ì¶œ
df[:3]

,account,name,street,city,state,postal-code,Jan,Feb,Mar
0,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000

In [48]:
# ì»¬ëŸ¼ ì´ë¦„ê³¼ ì¸ë±ìŠ¤ ì§€ì •ì‹œ í•´ë‹¹ ì»¬ëŸ¼ì˜ ë°ì´í„°ë§Œ ì¶”ì¶œ
df["account"][:3]

0    211829
1    320563
2    648336
Name: account, dtype: int64

In [49]:
# ë¦¬ìŠ¤íŠ¸ë¡œ ì¸ë±ìŠ¤ ì§€ì • ê°€ëŠ¥
df["account"][[1, 3, 5, 7, 9]]

1    320563
3    109996
5    132971
7    205217
9    212303
Name: account, dtype: int64

In [50]:
# ë¶ˆë¦¬ì–¸ ì¸ë±ì‹±ìœ¼ë¡œ Trueì¸ ë°ì´í„°ë§Œ ì¶”ì¶œ
df["account"][df["account"] < 250000]

0     211829
3     109996
4     121213
5     132971
6     145068
7     205217
8     209744
9     212303
10    214098
11    231907
12    242368
Name: account, dtype: int64

### 7.3. ì¸ë±ìŠ¤ ë³€ê²½

In [51]:
# í•œ ì»¬ëŸ¼ì„ ì§ì ‘ ì¸ë±ìŠ¤ë¡œ ì§€ì •
df.index = df["account"]
del df["account"]
df.head()

,name,street,city,state,postal-code,Jan,Feb,Mar
account,,,,,,,,
211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

### 7.4. reset_index - ì¸ë±ìŠ¤ ì¬ì„¤ì •

In [52]:
# ê¸°ì¡´ ì¸ë±ìŠ¤ëŠ” ìƒˆë¡œìš´ í”¼ì²˜ê°€ ë˜ê³  ë‹¤ì‹œ ë„˜ë²„ë§í•˜ì—¬ ìƒˆë¡œìš´ ì¸ë±ìŠ¤ ìƒì„±
df.reset_index(inplace=True)

### 7.5. drop - ì‚­ì œ

In [53]:
# ì¸ë±ìŠ¤ ë²ˆí˜¸ë¡œ ë°ì´í„° ì œê±°
df.drop(1)

,account,name,street,city,state,postal-code,Jan,Feb,Mar
0,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
2,648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000
5,132971,"Williamson, Schumm and Hettinger",89403 Casimer Spring,Jeremieburgh,Arkansas,62785,150000,120000,35000
6,145068,Casper LLC,340 Consuela Bridge Apt. 400,Lake Gabriellaton,Mississipi,18008,62000,120000,70000
7,205217,Kovacek-Johnston,91971 Cronin Vista Suite 601,Deronville,RhodeIsland,53461,145000,95000,35000
8,209744,Champlin-Morar,26739 Grant Lock,Lake Juliannton,Pennsylvania,64415,70000,95000,35000
9,212303,Gerhold-Maggio,366 Maggio Grove Apt. 998,North Ras,Idaho,46308,70000,120000,35000
10,214098,"Goodwin, Homenick and Jerde",649 Cierra Forks Apt. 078,Rosaberg,Tenessee,47743,45000,120000,55000
11,231907,Hahn-Moore,18115 Olivine Throughway,Norbertomouth,NorthDakota,31415,150000,10000,162000
12,242368,"Frami, Anderson and Donnelly",182 Bertie Road,East Davian,Iowa,72686,162000,120000,35000
13,268755,Walsh-Haley,2624 Beatty Parkways,Goodwinmouth,RhodeIsland,31919,55000,120000,35000
14,273274,McDermott PLC,8917 Bergstrom Meadow,Kathryneborough,Delaware,27933,150000,120000,70000

In [54]:
# ì •ìˆ˜ ë¦¬ìŠ¤íŠ¸ë¡œ ì—¬ëŸ¬ ê°œì˜ ë°ì´í„° ì œê±°
df.drop([0, 1, 2, 3])

,account,name,street,city,state,postal-code,Jan,Feb,Mar
4,121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000
5,132971,"Williamson, Schumm and Hettinger",89403 Casimer Spring,Jeremieburgh,Arkansas,62785,150000,120000,35000
6,145068,Casper LLC,340 Consuela Bridge Apt. 400,Lake Gabriellaton,Mississipi,18008,62000,120000,70000
7,205217,Kovacek-Johnston,91971 Cronin Vista Suite 601,Deronville,RhodeIsland,53461,145000,95000,35000
8,209744,Champlin-Morar,26739 Grant Lock,Lake Juliannton,Pennsylvania,64415,70000,95000,35000
9,212303,Gerhold-Maggio,366 Maggio Grove Apt. 998,North Ras,Idaho,46308,70000,120000,35000
10,214098,"Goodwin, Homenick and Jerde",649 Cierra Forks Apt. 078,Rosaberg,Tenessee,47743,45000,120000,55000
11,231907,Hahn-Moore,18115 Olivine Throughway,Norbertomouth,NorthDakota,31415,150000,10000,162000
12,242368,"Frami, Anderson and Donnelly",182 Bertie Road,East Davian,Iowa,72686,162000,120000,35000
13,268755,Walsh-Haley,2624 Beatty Parkways,Goodwinmouth,RhodeIsland,31919,55000,120000,35000
14,273274,McDermott PLC,8917 Bergstrom Meadow,Kathryneborough,Delaware,27933,150000,120000,70000

In [55]:
# axis=1ë¡œ ì§€ì •í•´ì„œ íŠ¹ì • ì»¬ëŸ¼ ì œê±°
df.drop("city", axis=1)

,account,name,street,state,postal-code,Jan,Feb,Mar
0,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,Texas,28752,10000,62000,35000
1,320563,Walter-Trantow,1311 Alvis Tunnel,NorthCarolina,38365,95000,45000,35000
2,648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,Iowa,76517,91000,120000,35000
3,109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Maine,46021,45000,120000,10000
4,121213,Bauch-Goldner,7274 Marissa Common,California,49681,162000,120000,35000
5,132971,"Williamson, Schumm and Hettinger",89403 Casimer Spring,Arkansas,62785,150000,120000,35000
6,145068,Casper LLC,340 Consuela Bridge Apt. 400,Mississipi,18008,62000,120000,70000
7,205217,Kovacek-Johnston,91971 Cronin Vista Suite 601,RhodeIsland,53461,145000,95000,35000
8,209744,Champlin-Morar,26739 Grant Lock,Pennsylvania,64415,70000,95000,35000
9,212303,Gerhold-Maggio,366 Maggio Grove Apt. 998,Idaho,46308,70000,120000,35000
10,214098,"Goodwin, Homenick and Jerde",649 Cierra Forks Apt. 078,Tenessee,47743,45000,120000,55000
11,231907,Hahn-Moore,18115 Olivine Throughway,NorthDakota,31415,150000,10000,162000
12,242368,"Frami, Anderson and Donnelly",182 Bertie Road,Iowa,72686,162000,120000,35000
13,268755,Walsh-Haley,2624 Beatty Parkways,RhodeIsland,31919,55000,120000,35000
14,273274,McDermott PLC,8917 Bergstrom Meadow,Delaware,27933,150000,120000,70000

In [56]:
# ì»¬ëŸ¼ ì´ë¦„ ë¦¬ìŠ¤íŠ¸ë¡œ ì—¬ëŸ¬ ê°œì˜ íŠ¹ì • ì»¬ëŸ¼ ì œê±°
df.drop(["city", "state"], axis=1)

,account,name,street,postal-code,Jan,Feb,Mar
0,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,28752,10000,62000,35000
1,320563,Walter-Trantow,1311 Alvis Tunnel,38365,95000,45000,35000
2,648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,76517,91000,120000,35000
3,109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,46021,45000,120000,10000
4,121213,Bauch-Goldner,7274 Marissa Common,49681,162000,120000,35000
5,132971,"Williamson, Schumm and Hettinger",89403 Casimer Spring,62785,150000,120000,35000
6,145068,Casper LLC,340 Consuela Bridge Apt. 400,18008,62000,120000,70000
7,205217,Kovacek-Johnston,91971 Cronin Vista Suite 601,53461,145000,95000,35000
8,209744,Champlin-Morar,26739 Grant Lock,64415,70000,95000,35000
9,212303,Gerhold-Maggio,366 Maggio Grove Apt. 998,46308,70000,120000,35000
10,214098,"Goodwin, Homenick and Jerde",649 Cierra Forks Apt. 078,47743,45000,120000,55000
11,231907,Hahn-Moore,18115 Olivine Throughway,31415,150000,10000,162000
12,242368,"Frami, Anderson and Donnelly",182 Bertie Road,72686,162000,120000,35000
13,268755,Walsh-Haley,2624 Beatty Parkways,31919,55000,120000,35000
14,273274,McDermott PLC,8917 Bergstrom Meadow,27933,150000,120000,70000

## 8. Dataframe Operations

### 8.1. Series Operations

In [57]:
s1 = pd.Series(range(1, 6), index=list("abced"))
s2 = pd.Series(range(5, 11), index=list("bcedef"))
s1, s2

(a    1
 b    2
 c    3
 e    4
 d    5
 dtype: int64,
 b     5
 c     6
 e     7
 d     8
 e     9
 f    10
 dtype: int64)

In [58]:
# ë§ì…ˆ
# ì¸ë±ìŠ¤ë¥¼ ê¸°ì¤€ìœ¼ë¡œ ì—°ì‚°í•˜ë©° ë°ì´í„°ê°€ ì—†ëŠ” ê²½ìš° NaNìœ¼ë¡œ ë°˜í™˜
print(s1 + s2)
print(s1.add(s2))

a     NaN
b     7.0
c     9.0
d    13.0
e    11.0
e    13.0
f     NaN
dtype: float64
a     NaN
b     7.0
c     9.0
d    13.0
e    11.0
e    13.0
f     NaN
dtype: float64

In [59]:
# ëº¼ì…ˆ
print(s1 - s2)
print(s1.sub(s2))

a    NaN
b   -3.0
c   -3.0
d   -3.0
e   -3.0
e   -5.0
f    NaN
dtype: float64
a    NaN
b   -3.0
c   -3.0
d   -3.0
e   -3.0
e   -5.0
f    NaN
dtype: float64

In [60]:
# ê³±ì…ˆ
print(s1 * s2)
print(s1.mul(s2))

a     NaN
b    10.0
c    18.0
d    40.0
e    28.0
e    36.0
f     NaN
dtype: float64
a     NaN
b    10.0
c    18.0
d    40.0
e    28.0
e    36.0
f     NaN
dtype: float64

In [61]:
# ë‚˜ëˆ—ì…ˆ
print(s1 / s2)
print(s1.div(s2))

a         NaN
b    0.400000
c    0.500000
d    0.625000
e    0.571429
e    0.444444
f         NaN
dtype: float64
a         NaN
b    0.400000
c    0.500000
d    0.625000
e    0.571429
e    0.444444
f         NaN
dtype: float64

### 8.2. Dataframe Operations

In [62]:
df1 = pd.DataFrame(np.arange(9).reshape(3, 3), columns=list("abc"))
df1

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [63]:
df2 = pd.DataFrame(np.arange(16).reshape(4, 4), columns=list("abcd"))
df2

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [64]:
# ë§ì…ˆ
# ì¸ë±ìŠ¤ì™€ ì»¬ëŸ¼ ëª¨ë‘ ê³ ë ¤í•˜ë©° ë°ì´í„°ê°€ ì—†ëŠ” ê²½ìš° NaNìœ¼ë¡œ ë°˜í™˜
df1 + df2

      a     b     c   d
0   0.0   2.0   4.0 NaN
1   7.0   9.0  11.0 NaN
2  14.0  16.0  18.0 NaN
3   NaN   NaN   NaN NaN

In [65]:
# fill_valueë¡œ NaNì„ ë‹¤ë¥¸ ê°’ìœ¼ë¡œ ëŒ€ì²´ ê°€ëŠ¥
df1.add(df2, fill_value=0)

      a     b     c     d
0   0.0   2.0   4.0   3.0
1   7.0   9.0  11.0   7.0
2  14.0  16.0  18.0  11.0
3  12.0  13.0  14.0  15.0

In [66]:
# ëº¼ì…ˆ
print(df1 - df2)
print(df1.sub(df2))

     a    b    c   d
0  0.0  0.0  0.0 NaN
1 -1.0 -1.0 -1.0 NaN
2 -2.0 -2.0 -2.0 NaN
3  NaN  NaN  NaN NaN
     a    b    c   d
0  0.0  0.0  0.0 NaN
1 -1.0 -1.0 -1.0 NaN
2 -2.0 -2.0 -2.0 NaN
3  NaN  NaN  NaN NaN

In [67]:
# ê³±ì…ˆ
print(df1 * df2)
print(df1.mul(df2))

      a     b     c   d
0   0.0   1.0   4.0 NaN
1  12.0  20.0  30.0 NaN
2  48.0  63.0  80.0 NaN
3   NaN   NaN   NaN NaN
      a     b     c   d
0   0.0   1.0   4.0 NaN
1  12.0  20.0  30.0 NaN
2  48.0  63.0  80.0 NaN
3   NaN   NaN   NaN NaN

In [68]:
# ë‚˜ëˆ—ì…ˆ
print(df1 / df2)
print(df1.div(df2))

      a         b         c   d
0   NaN  1.000000  1.000000 NaN
1  0.75  0.800000  0.833333 NaN
2  0.75  0.777778  0.800000 NaN
3   NaN       NaN       NaN NaN
      a         b         c   d
0   NaN  1.000000  1.000000 NaN
1  0.75  0.800000  0.833333 NaN
2  0.75  0.777778  0.800000 NaN
3   NaN       NaN       NaN NaN

### 8.3. Operations with Dataframe and Series

#### 8.3.1. Seriesì— ì¸ë±ìŠ¤ê°€ Dataframeì˜ ì»¬ëŸ¼ ì´ë¦„ì¸ ê²½ìš°

In [69]:
df = pd.DataFrame(np.arange(16).reshape(4, 4), columns=list("abcd"))
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [70]:
s = pd.Series(np.arange(10, 14), index=list("abcd"))
s

a    10
b    11
c    12
d    13
dtype: int32

In [71]:
# ê° ì»¬ëŸ¼ì— ë§ì…ˆ ìˆ˜í–‰
df + s

    a   b   c   d
0  10  12  14  16
1  14  16  18  20
2  18  20  22  24
3  22  24  26  28

#### 8.3.2. Series ì¸ë±ìŠ¤ê°€ Dataframeì˜ ì»¬ëŸ¼ ì´ë¦„ì´ ì•„ë‹Œ ê²½ìš°

In [72]:
s2 = pd.Series(np.arange(10, 14))
s2

0    10
1    11
2    12
3    13
dtype: int32

In [73]:
# ê·¸ëƒ¥ ë”í•˜ë©´ ê¸°ì¤€ê°’ì´ ì—†ì–´ ëª¨ë‘ NaNê°’ì´ ë¨
df + s2

    a   b   c   d   0   1   2   3
0 NaN NaN NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN NaN NaN

In [74]:
# axisë¥¼ ê¸°ì¤€ìœ¼ë¡œ row broadcastingì„ ìˆ˜í–‰
df.add(s2, axis=0)

    a   b   c   d
0  10  11  12  13
1  15  16  17  18
2  20  21  22  23
3  25  26  27  28

## 9. map, apply

### 9.1. map
- **Series ë°ì´í„°(íŠ¹ì • ì»¬ëŸ¼)**ë¥¼ ë³€í™˜í•˜ê³  ì‹¶ì„ ë•Œ ì‚¬ìš©í•œë‹¤.
- í•¨ìˆ˜ì˜ ì…ë ¥ê°’ì€ **Seriesì˜ ìš”ì†Œ í•˜ë‚˜ì”©**ì´ë‹¤.

#### 9.1.1. map with lambda

In [75]:
s1 = pd.Series(np.arange(10))
s1.head(5)

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [76]:
# labmdaì‹ìœ¼ë¡œ í•¨ìˆ˜ ì •ì˜
s1.map(lambda x: x**2).head()

0     0
1     1
2     4
3     9
4    16
dtype: int64

In [77]:
# ì¼ë°˜ í•¨ìˆ˜ë„ ê°€ëŠ¥
def func(x):
    return x**2
s1.map(func).head()

0     0
1     1
2     4
3     9
4    16
dtype: int64

#### 9.1.2. map with dict

In [78]:
# ì¸ë±ìŠ¤ì— ë§ì¶° value ë³€í™˜
z = {1: "A", 2: "B", 3: "C"}
s1.map(z).head()

0    NaN
1      A
2      B
3      C
4    NaN
dtype: object

In [79]:
df = pd.read_csv("./data/wages.csv")
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [80]:
# Label Indexingí•  ë•Œ ì¢‹ë‹¤
df["sex_bin"] = df.sex.map({"male": 0, "female": 1})
df.head()

           earn  height     sex   race  ed  age  sex_bin
0  79571.299011   73.89    male  white  16   49        0
1  96396.988643   66.23  female  white  16   62        1
2  48710.666947   63.77  female  white  16   33        1
3  80478.096153   63.22  female  other  16   95        1
4  82089.345498   63.08  female  white  17   43        1

#### 9.1.3. map with Series

In [81]:
# ê°™ì€ ìœ„ì¹˜ì˜ Series ê°’ìœ¼ë¡œ ëŒ€ì²´
s2 = pd.Series(np.arange(10, 20))
s1.map(s2).head()

0    10
1    11
2    12
3    13
4    14
dtype: int32

### 9.2. replace
`map` í•¨ìˆ˜ì˜ ê¸°ëŠ¥ ì¤‘ **ë°ì´í„° ë³€í™˜ ê¸°ëŠ¥**ë§Œ ë–¼ì–´ì˜¨ í•¨ìˆ˜

In [82]:
# mapê³¼ ë˜‘ê°™ì´ dictë¥¼ ë„£ì–´ì„œ ë³€í™˜ ê°€ëŠ¥
df.sex.replace({"male": 0, "female": 1}).head()

0    0
1    1
2    1
3    1
4    1
Name: sex, dtype: int64

In [83]:
# to_replace ë¦¬ìŠ¤íŠ¸ì™€ value ë¦¬ìŠ¤íŠ¸ë¡œ 1:1 ëŒ€ì‘ì‹œì¼œ ë³€í™˜ ê°€ëŠ¥
df.sex.replace(to_replace=["male", "female"], value=[0, 1], inplace=True)
df.head()

           earn  height  sex   race  ed  age  sex_bin
0  79571.299011   73.89    0  white  16   49        0
1  96396.988643   66.23    1  white  16   62        1
2  48710.666947   63.77    1  white  16   33        1
3  80478.096153   63.22    1  other  16   95        1
4  82089.345498   63.08    1  white  17   43        1

### 9.3. apply
- ì „ì²´ ì»¬ëŸ¼ ì¦‰, **ë°ì´í„°í”„ë ˆì„**ì— í•¨ìˆ˜ë¥¼ ì ìš©ì‹œí‚¨ë‹¤.
- í•¨ìˆ˜ì˜ ì…ë ¥ê°’ì€ **Series**ì´ë‹¤.

In [84]:
df = pd.read_csv("./data/wages.csv")
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [85]:
df_eha = df[["earn", "height", "age"]]
df_eha.head()

           earn  height  age
0  79571.299011   73.89   49
1  96396.988643   66.23   62
2  48710.666947   63.77   33
3  80478.096153   63.22   95
4  82089.345498   63.08   43

#### 9.3.1. apply with lambda

In [86]:
# ê° ì»¬ëŸ¼ë³„ ê²°ê³¼ê°’ì„ ë°˜í™˜
df_eha.apply(lambda x: x.max() - x.min())

earn      318047.708444
height        19.870000
age           73.000000
dtype: float64

#### 9.3.2. apply with built-in function

In [87]:
# ë‚´ì¥í•¨ìˆ˜ë¥¼ ì“°ëŠ” ê²ƒê³¼ ë™ì¼
df_eha.apply(sum)

earn      4.474344e+07
height    9.183125e+04
age       6.250800e+04
dtype: float64

In [88]:
df_eha.sum()

earn      4.474344e+07
height    9.183125e+04
age       6.250800e+04
dtype: float64

In [89]:
# mean - ê° ì»¬ëŸ¼ë³„ í‰ê· 
# std - ê° ì»¬ë ´ë³„ í‘œì¤€í¸ì°¨
df_eha.apply(np.mean), df_eha.apply(np.std)

(earn      32446.292622
 height       66.592640
 age          45.328499
 dtype: float64,
 earn      31245.734713
 height        3.816723
 age          15.783988
 dtype: float64)

#### 9.3.3. apply with Series

In [90]:
# ìŠ¤ì¹¼ë¼ ê°’ ì™¸ì— Series ê°’ë„ ë°˜í™˜ì´ ê°€ëŠ¥
def func(x):
    return pd.Series([x.min(), x.max()], index=["min", "max"])

df_eha.apply(func)

              earn  height  age
min     -98.580489   57.34   22
max  317949.127955   77.21   95

### 9.4. applymap
`map`ì€ Seriesì—ë§Œ ì ìš© ê°€ëŠ¥í•œë° DataFrameì— `map`ê³¼ ê°™ì€ íš¨ê³¼ë¥¼ ë‚´ê³  ì‹¶ì„ ë•Œ ì‚¬ìš©í•œë‹¤.
- Series ë‹¨ìœ„ë¡œ ì ìš©í•˜ëŠ” `apply`ì™€ëŠ” ë‹¬ë¦¬ **ìš”ì†Œ ë‹¨ìœ„**ë¡œ í•¨ìˆ˜ë¥¼ ì ìš©í•œë‹¤.
- í•¨ìˆ˜ì˜ ì…ë ¥ì€ **Seriesì˜ ìš”ì†Œ í•˜ë‚˜**ì´ë‹¤.
- Seriesì— `apply`ë¥¼ ì ìš©í–ˆì„ ë•Œì™€ ê°™ì€ íš¨ê³¼ë¥¼ ë‚¸ë‹¤.

In [91]:
# í•¨ìˆ˜ë¥¼ ëª¨ë“  ìš”ì†Œì— ì ìš©
df_eha.applymap(lambda x: -x).head()

           earn  height  age
0 -79571.299011  -73.89  -49
1 -96396.988643  -66.23  -62
2 -48710.666947  -63.77  -33
3 -80478.096153  -63.22  -95
4 -82089.345498  -63.08  -43

In [92]:
# Seriesì— applyë¥¼ ì ìš©ì‹œí‚¨ ê²ƒê³¼ ê°™ì€ íš¨ê³¼
df_eha.earn.apply(lambda x: -x).head()

0   -79571.299011
1   -96396.988643
2   -48710.666947
3   -80478.096153
4   -82089.345498
Name: earn, dtype: float64

## 10. Pandas Built-in Functions

In [93]:
df = pd.read_csv("./data/wages.csv")
df.head(2).T

                   0             1
earn    79571.299011  96396.988643
height         73.89         66.23
sex             male        female
race           white         white
ed                16            16
age               49            62

### 10.1. describe - ë°ì´í„° ìš”ì•½ ì •ë³´

In [94]:
# Numeric ë°ì´í„°ì˜ í†µê³„ì  ì •ë³´ë¥¼ ë³´ì—¬ì¤€ë‹¤
# ë¬¸ìì—´ê°™ì€ Obj ë°ì´í„°ëŠ” ì œì™¸í•œë‹¤
df.describe()

                earn       height           ed          age
count    1379.000000  1379.000000  1379.000000  1379.000000
mean    32446.292622    66.592640    13.354605    45.328499
std     31257.070006     3.818108     2.438741    15.789715
min       -98.580489    57.340000     3.000000    22.000000
25%     10538.790721    63.720000    12.000000    33.000000
50%     26877.870178    66.050000    13.000000    42.000000
75%     44506.215336    69.315000    15.000000    55.000000
max    317949.127955    77.210000    18.000000    95.000000

### 10.2. unique - Series ë°ì´í„°ì˜ ìœ ì¼ê°’ ë¦¬ìŠ¤íŠ¸ ë°˜í™˜

In [95]:
df.race.unique()

array(['white', 'other', 'hispanic', 'black'], dtype=object)

### 10.3. ê¸°ë³¸ ì—°ì‚°
- `sum`, `sub`, `mean`, `min`, `max`, `count`, `median`, `mad`, `var` ë“± ë‹¤ì–‘í•œ ì—°ì‚°ì„ ì§€ì›í•œë‹¤.
- axisë¥¼ ì„¤ì •í•˜ì—¬ ì ìš© ì¶•ì„ ì„¤ì •í•  ìˆ˜ ìˆë‹¤.
    - `axis=0`: ì»¬ëŸ¼ë³„ ì ìš©
    - `axis=1`: ë°ì´í„°(ë¡œìš°)ë³„ ì ìš©

In [96]:
# ì»¬ëŸ¼ë³„ ì ìš©
df.sum(axis=0)

earn                                          44743437.5254
height                                             91831.25
sex       malefemalefemalefemalefemalefemalefemalemalema...
race      whitewhitewhiteotherwhitewhitewhitewhitehispan...
ed                                                    18416
age                                                   62508
dtype: object

In [97]:
# ë°ì´í„°/ë¡œìš°ë³„ ì ìš©
df.sum(axis=1)

0       79710.189011
1       96541.218643
2       48823.436947
3       80652.316153
4       82212.425498
            ...
1374    30290.060363
1375    25018.829514
1376    13823.311312
1377    95563.664410
1378     9686.681857
Length: 1379, dtype: float64

### 10.4. isnull - NaNê°’ì˜ ì¸ë±ìŠ¤ ë°˜í™˜

In [98]:
df.isnull()

       earn  height    sex   race     ed    age
0     False   False  False  False  False  False
1     False   False  False  False  False  False
2     False   False  False  False  False  False
3     False   False  False  False  False  False
4     False   False  False  False  False  False
...     ...     ...    ...    ...    ...    ...
1374  False   False  False  False  False  False
1375  False   False  False  False  False  False
1376  False   False  False  False  False  False
1377  False   False  False  False  False  False
1378  False   False  False  False  False  False

[1379 rows x 6 columns]

In [99]:
# sumì„ ì‚¬ìš©í•˜ì—¬ ì»¬ëŸ¼ë³„ ê²°ì¸¡ì¹˜ ê°œìˆ˜ë¥¼ êµ¬í•  ìˆ˜ ìˆë‹¤
df.isnull().sum()

earn      0
height    0
sex       0
race      0
ed        0
age       0
dtype: int64

### 10.5. sort_values - ì»¬ëŸ¼ ê°’ì„ ê¸°ì¤€ìœ¼ë¡œ ë°ì´í„°ë¥¼ ì •ë ¬

In [100]:
# ageë¥¼ ê¸°ì¤€ìœ¼ë¡œ ì˜¤ë¦„ì°¨ìˆœ ì •ë ¬
df.sort_values("age", ascending=True).head()

             earn  height     sex   race  ed  age
562   4831.589257   71.34    male  black  11   22
522   1955.168187   69.87  female  black  12   22
1301  4159.033222   61.54  female  white  13   22
1105   988.565070   64.71  female  white  12   22
1112  4160.531055   67.87  female  white  12   22

In [101]:
# ageë¡œ ì •ë ¬í•˜ê³  ê°™ë‹¤ë©´ earnìœ¼ë¡œ ì •ë ¬
df.sort_values(["age", "earn"], ascending=True).head()

             earn  height     sex      race  ed  age
1038   -56.321979   67.81    male  hispanic  10   22
800    -27.876819   72.29    male     white  12   22
963    -25.655260   68.90    male     white  12   22
1105   988.565070   64.71  female     white  12   22
801   1000.221504   64.09  female     white  12   22

### 10.6. value_counts - ì»¬ëŸ¼ì˜ ê°’ë³„ ê°œìˆ˜ ë°˜í™˜

In [102]:
df.age.value_counts()

36    45
32    43
33    42
34    41
43    40
      ..
89     1
90     1
91     1
92     1
93     1
Name: age, Length: 73, dtype: int64

### 10.7. corr, cov, corrwith - ìƒê´€ê³„ìˆ˜ì™€ ê³µë¶„ì‚°

In [103]:
# ageì™€ earnì˜ ìƒê´€ê³„ìˆ˜
df.age.corr(df.earn)

0.07400349177836056

In [104]:
# ì „ì²´ ë°ì´í„° í”„ë ˆì„ìœ¼ë¡œ ì ìš©í•˜ë©´ ëª¨ë“  ì»¬ëŸ¼ ê°„ì˜ ìƒê´€ê³„ìˆ˜ DataFrame ë°˜í™˜
df.corr()

            earn    height        ed       age
earn    1.000000  0.291600  0.350374  0.074003
height  0.291600  1.000000  0.114047 -0.133727
ed      0.350374  0.114047  1.000000 -0.129802
age     0.074003 -0.133727 -0.129802  1.000000

In [105]:
# ageì™€ earnì˜ ê³µë¶„ì‚°
df.age.cov(df.earn)

36523.69921040891

In [106]:
# í•œ ì»¬ëŸ¼ì˜ ë‹¤ë¥¸ ì»¬ëŸ¼ê³¼ì˜ ìƒê´€ê³„ìˆ˜ Series ë°˜í™˜
df.corrwith(df.earn)

earn      1.000000
height    0.291600
ed        0.350374
age       0.074003
dtype: float64

## 11. Groupby
![Groupby í•¨ìˆ˜](./img/groupby_func.png)
![Groupby ê³¼ì •](./img/groupby.png)

In [107]:
ipl_data = {
    "Team": ["Riders","Riders","Devils","Devils","Kings","kings","Kings","Kings","Riders","Royals","Royals","Riders"],
    "Rank": [1, 2, 2, 3, 3, 4, 1, 1, 2, 4, 1, 2],
    "Year": [2014, 2015, 2014, 2015, 2014, 2015, 2016, 2017, 2016, 2014, 2015, 2017],
    "Points": [876, 789, 863, 673, 741, 812, 756, 788, 694, 701, 804, 690],
}
df = pd.DataFrame(ipl_data)
df.head()

     Team  Rank  Year  Points
0  Riders     1  2014     876
1  Riders     2  2015     789
2  Devils     2  2014     863
3  Devils     3  2015     673
4   Kings     3  2014     741

**`â—ì£¼ì˜`** groupbyë¥¼ í•˜ê³  aggregation í•¨ìˆ˜ë¥¼ ë¶™ì—¬ì¤˜ì•¼ ì›í•˜ëŠ” ê°’ì´ ë‚˜ì˜¨ë‹¤. groupbyëŠ” ì»¬ëŸ¼ì˜ ê°’ë³„ë¡œ ë°ì´í„°í”„ë ˆì„ì„ splití•´ì£¼ëŠ” ê²ƒê¹Œì§€ë§Œ í•œë‹¤.

In [108]:
df.groupby(['Team'])['Points']

### 11.1. Hierarchical Index
ì™¼ìª½ ì¼ìˆ˜ë¡ **ëŒ€ë¶„ë¥˜**, ì˜¤ë¥¸ìª½ ì¼ìˆ˜ë¡ **ì†Œë¶„ë¥˜** ê¸°ì¤€ì´ ëœë‹¤.

In [109]:
# 2ê°œë¥¼ ê¸°ì¤€ìœ¼ë¡œ ë¬¶ëŠ” ê²½ìš°
df_ty = df.groupby(['Team', 'Year'])['Points'].sum()
df_ty

Team    Year
Devils  2014    863
        2015    673
Kings   2014    741
        2016    756
        2017    788
Riders  2014    876
        2015    789
        2016    694
        2017    690
Royals  2014    701
        2015    804
kings   2015    812
Name: Points, dtype: int64

In [110]:
# 3ê°œë¥¼ ê¸°ì¤€ìœ¼ë¡œ ë¬¶ëŠ” ê²½ìš°
df_tyr = df.groupby(['Team', 'Year', 'Rank'])['Points'].sum()
df_tyr

Team    Year  Rank
Devils  2014  2       863
        2015  3       673
Kings   2014  3       741
        2016  1       756
        2017  1       788
Riders  2014  1       876
        2015  2       789
        2016  2       694
        2017  2       690
Royals  2014  4       701
        2015  1       804
kings   2015  4       812
Name: Points, dtype: int64

In [111]:
# ìŠ¬ë¼ì´ì‹±ë„ ê°€ëŠ¥í•˜ë‹¤
df_ty["Devils":"Rider"]

Team    Year
Devils  2014    863
        2015    673
Kings   2014    741
        2016    756
        2017    788
Name: Points, dtype: int64

`groupby`ì˜ ê²°ê³¼ë„ ë°ì´í„°í”„ë ˆì„ì´ë¯€ë¡œ ì¸ë±ìŠ¤ê°€ ì¡´ì¬í•˜ëŠ”ë°, 2ê°œì˜ ì»¬ëŸ¼ìœ¼ë¡œ `groupby`ë¥¼ í•  ê²½ìš° Indexê°€ 2ê°œ ìƒì„±ëœë‹¤.

In [112]:
df_ty.index

MultiIndex([('Devils', 2014),
            ('Devils', 2015),
            ( 'Kings', 2014),
            ( 'Kings', 2016),
            ( 'Kings', 2017),
            ('Riders', 2014),
            ('Riders', 2015),
            ('Riders', 2016),
            ('Riders', 2017),
            ('Royals', 2014),
            ('Royals', 2015),
            ( 'kings', 2015)],
           names=['Team', 'Year'])

### 11.2. unstack - ê·¸ë£¹ìœ¼ë¡œ ë¬¶ì¸ ë°ì´í„°ë¥¼ í–‰ë ¬ í˜•íƒœë¡œ ì „í™˜
ì¸ë±ìŠ¤ì—ì„œ ê°€ì¥ ë‚˜ì¤‘ì— ìˆëŠ”, ë§ˆì§€ë§‰ì— ìˆëŠ” ì»¬ëŸ¼ì´ ì»¬ëŸ¼ì´ ëœë‹¤.

In [113]:
# 2ê°œë¡œ ë¬¶ì—ˆì„ ê²½ìš°ì˜ unstack - Yearê°€ ì»¬ëŸ¼ìœ¼ë¡œ
df_ty.unstack()

Year     2014   2015   2016   2017
Team
Devils  863.0  673.0    NaN    NaN
Kings   741.0    NaN  756.0  788.0
Riders  876.0  789.0  694.0  690.0
Royals  701.0  804.0    NaN    NaN
kings     NaN  812.0    NaN    NaN

In [114]:
# 3ê°œë¡œ ë¬¶ì—ˆì„ ê²½ìš°ì˜ unstack - Rankê°€ ì»¬ëŸ¼ìœ¼ë¡œ
df_tyr.unstack()

Rank             1      2      3      4
Team   Year
Devils 2014    NaN  863.0    NaN    NaN
       2015    NaN    NaN  673.0    NaN
Kings  2014    NaN    NaN  741.0    NaN
       2016  756.0    NaN    NaN    NaN
       2017  788.0    NaN    NaN    NaN
Riders 2014  876.0    NaN    NaN    NaN
       2015    NaN  789.0    NaN    NaN
       2016    NaN  694.0    NaN    NaN
       2017    NaN  690.0    NaN    NaN
Royals 2014    NaN    NaN    NaN  701.0
       2015  804.0    NaN    NaN    NaN
kings  2015    NaN    NaN    NaN  812.0

### 11.3. swaplevel - ì¸ë±ìŠ¤ ë ˆë²¨ ë³€ê²½

In [115]:
# Team, Yearì˜ Levelì„ ë°”ê¿ˆ -> Yearê°€ ëŒ€ë¶„ë¥˜ê°€ ëœë‹¤
# ì´ë ‡ê²Œ ë˜ë©´ groupbyë¥¼ í•œ ì˜ë¯¸ê°€ ì—†ì–´ì§„ë‹¤
df_ty.swaplevel()

Year  Team
2014  Devils    863
2015  Devils    673
2014  Kings     741
2016  Kings     756
2017  Kings     788
2014  Riders    876
2015  Riders    789
2016  Riders    694
2017  Riders    690
2014  Royals    701
2015  Royals    804
      kings     812
Name: Points, dtype: int64

In [116]:
# levelì„ ë°”ê¾¸ê³  ë‚œ ë’¤ì— sort_indexì„ í•´ì„œ ë‹¤ì‹œ ì¬ì •ë ¬í•´ì£¼ì
df_ty.swaplevel().sort_index(level=0)

Year  Team
2014  Devils    863
      Kings     741
      Riders    876
      Royals    701
2015  Devils    673
      Riders    789
      Royals    804
      kings     812
2016  Kings     756
      Riders    694
2017  Kings     788
      Riders    690
Name: Points, dtype: int64

### 11.4. ê¸°ë³¸ ì—°ì‚°
Index Levelì„ ê¸°ì¤€ìœ¼ë¡œ ê¸°ë³¸ ì—°ì‚° ì ìš©í•  ìˆ˜ ìˆë‹¤.

In [117]:
# Level=0ì¸ Teamì„ ê¸°ì¤€ìœ¼ë¡œ sumì—°ì‚° ì ìš©
df_ty.sum(level=0)

Team
Devils    1536
Kings     2285
Riders    3049
Royals    1505
kings      812
Name: Points, dtype: int64

In [119]:
# Level=1ì¸ Yearì„ ê¸°ì¤€ìœ¼ë¡œ sumì—°ì‚° ì ìš©
df_ty.sum(level=1)

Year
2014    3181
2015    3078
2016    1450
2017    1478
Name: Points, dtype: int64

### 11.5. Grouped - Splitëœ ìƒíƒœ

In [133]:
grouped = df.groupby("Team")

In [121]:
# forë¬¸ìœ¼ë¡œ ì–¸íŒ¨í‚¹í•  ë•Œ ê·¸ë£¹ì´ë¦„ê³¼ íŠœí”Œ í˜•íƒœì˜ í…Œì´ë¸”ì„ ë°˜í™˜
for group_name, table in grouped:
    print(group_name)
    print(table)

Devils
     Team  Rank  Year  Points
2  Devils     2  2014     863
3  Devils     3  2015     673
Kings
    Team  Rank  Year  Points
4  Kings     3  2014     741
6  Kings     1  2016     756
7  Kings     1  2017     788
Riders
      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
8   Riders     2  2016     694
11  Riders     2  2017     690
Royals
      Team  Rank  Year  Points
9   Royals     4  2014     701
10  Royals     1  2015     804
kings
    Team  Rank  Year  Points
5  kings     4  2015     812

In [122]:
# íŠ¹ì • ê·¸ë£¹ì˜ í…Œì´ë¸” ì¶”ì¶œ
grouped.get_group("Devils")

     Team  Rank  Year  Points
2  Devils     2  2014     863
3  Devils     3  2015     673

#### 11.5.1. aggregation - ê·¸ë£¹ë³„ ê¸°ë³¸ ì—°ì‚°
`sum`, `mean`ë“± ì—¬ëŸ¬ í†µê³„ì •ë³´ë¥¼ ì¶”ì¶œí•œë‹¤.

In [123]:
# ê° ê·¸ë£¹ë³„ í•©ê³„
grouped.agg(max)

        Rank  Year  Points
Team
Devils     3  2015     863
Kings      3  2017     788
Riders     2  2017     876
Royals     4  2015     804
kings      4  2015     812

In [124]:
# ê° ê·¸ë£¹ë³„ í‰ê· 
grouped.agg(np.mean)

            Rank         Year      Points
Team
Devils  2.500000  2014.500000  768.000000
Kings   1.666667  2015.666667  761.666667
Riders  1.750000  2015.500000  762.250000
Royals  2.500000  2014.500000  752.500000
kings   4.000000  2015.000000  812.000000

In [126]:
# í•œ ë²ˆì— ì—¬ëŸ¬ ê°œ ì ìš© ê°€ëŠ¥í•˜ì§€ë§Œ íŠ¹ì • ì»¬ëŸ¼ì„ ì§€ì •í•´ì•¼í•¨
grouped['Points'].agg([sum, np.mean, np.std])

         sum        mean         std
Team
Devils  1536  768.000000  134.350288
Kings   2285  761.666667   24.006943
Riders  3049  762.250000   88.567771
Royals  1505  752.500000   72.831998
kings    812  812.000000         NaN

#### 11.5.2. transform - ê°œë³„ ë°ì´í„° ë³€í™˜.

In [127]:
# ê¸°ì¤€ì¸ Team ë¹¼ê³  DataFrame ì›ë˜ í˜•íƒœë¡œ ë³€í™˜
grouped.transform(lambda x: (x))

    Rank  Year  Points
0      1  2014     876
1      2  2015     789
2      2  2014     863
3      3  2015     673
4      3  2014     741
5      4  2015     812
6      1  2016     756
7      1  2017     788
8      2  2016     694
9      4  2014     701
10     1  2015     804
11     2  2017     690

In [129]:
# ê·¸ë£¹ì˜ ìµœëŒ€ê°’ìœ¼ë¡œ ë³€í™˜ -> ê°™ì€ ê·¸ë£¹ì´ë©´ ê°’ì´ ê°™ìŒ
grouped.transform(lambda x: x.max())

    Rank  Year  Points
0      2  2017     876
1      2  2017     876
2      3  2015     863
3      3  2015     863
4      3  2017     788
5      4  2015     812
6      3  2017     788
7      3  2017     788
8      2  2017     876
9      4  2015     804
10     4  2015     804
11     2  2017     876

In [134]:
# ê°œë³„ ë°ì´í„° ì •ê·œí™”
grouped.transform(lambda x: (x - x.mean()) / x.std())

        Rank      Year    Points
0  -1.500000 -1.161895  1.284327
1   0.500000 -0.387298  0.302029
2  -0.707107 -0.707107  0.707107
3   0.707107  0.707107 -0.707107
4   1.154701 -1.091089 -0.860862
5        NaN       NaN       NaN
6  -0.577350  0.218218 -0.236043
7  -0.577350  0.872872  1.096905
8   0.500000  0.387298 -0.770596
9   0.707107 -0.707107 -0.707107
10 -0.707107  0.707107  0.707107
11  0.500000  1.161895 -0.815759

#### 11.5.3. filter - íŠ¹ì • ì¡°ê±´ì˜ ë°ì´í„° ì¶”ì¶œ

In [135]:
# ê·¸ë£¹ëª…ì˜ ê¸¸ì´ê°€ 3ì´ìƒì¸ ë°ì´í„°ë§Œ ì¶”ì¶œ
grouped.filter(lambda x: len(x) >= 3)

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
4    Kings     3  2014     741
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
11  Riders     2  2017     690

In [136]:
# ê·¸ë£¹ì˜ í¬ì¸íŠ¸ í•©ì´ 1000 ì´ìƒì¸ ë°ì´í„°ë§Œ ì¶”ì¶œ
grouped.filter(lambda x: x['Points'].sum() > 1000)

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

## 12. Pivot Table
íŠ¹ì • ì»¬ëŸ¼ì´ `ë‹¤ë¥¸ ì»¬ëŸ¼ë“¤`ì— ì˜í•´ ì–´ë–»ê²Œ ë¶„ë¥˜ë˜ëŠ”ì§€ ë³´ê³  ì‹¶ì„ ë•Œ ì‚¬ìš©í•˜ë©´ ì¢‹ë‹¤. ì•½ê°„ ì¡°ê±´ë¶€í™•ë¥ í‘œë¥¼ ë³´ëŠ” ëŠë‚Œì´ë‹¤.
- ì¸ë±ìŠ¤ëŠ” `groupby`ì™€ ë™ì¼í•˜ë‹¤.
- ì»¬ëŸ¼ì— ì¶”ê°€ë¡œ ë¼ë²¨ë§ ê°’ì„ ì¶”ê°€í•˜ì—¬ valueì— ìˆ«ìí˜• ê°’ì„ aggregationí•˜ëŠ” í˜•íƒœì´ë‹¤.

In [148]:
import dateutil
df = pd.read_csv("./data/phone_data.csv")
df["date"] = df["date"].apply(dateutil.parser.parse, dayfirst=True)
df.head()

   index                date  duration  item    month   network network_type
0      0 2014-10-15 06:58:00    34.429  data  2014-11      data         data
1      1 2014-10-15 06:58:00    13.000  call  2014-11  Vodafone       mobile
2      2 2014-10-15 14:46:00    23.000  call  2014-11    Meteor       mobile
3      3 2014-10-15 14:48:00     4.000  call  2014-11     Tesco       mobile
4      4 2014-10-15 17:27:00     4.000  call  2014-11     Tesco       mobile

In [149]:
df.pivot_table(
    values=["duration"],                    # í…Œì´ë¸” ì¸ë±ìŠ¤ì™€ ì»¬ëŸ¼ìœ¼ë¡œ ë¶„ë¥˜í•  ì»¬ëŸ¼ ì§€ì •
    index=[df_phone.month, df_phone.item],  # í…Œì´ë¸” ì¸ë±ìŠ¤ ì§€ì •
    columns=df_phone.network,               # í…Œì´ë¸” ì»¬ëŸ¼ ì§€ì •
    aggfunc="sum",                          # ì ìš©í•  ì—°ì‚°
    fill_value=0,                           # NaN ëŒ€ì²´ê°’
)

             duration                                                   \
network        Meteor Tesco  Three Vodafone      data landline special
month   item
2014-11 call     1521  4045  12458     4316     0.000     2906       0
        data        0     0      0        0   998.441        0       0
        sms        10     3     25       55     0.000        0       1
2014-12 call     2010  1819   6316     1302     0.000     1424       0
        data        0     0      0        0  1032.870        0       0
        sms        12     1     13       18     0.000        0       0
2015-01 call     2207  2904   6445     3626     0.000     1603       0
        data        0     0      0        0  1067.299        0       0
        sms        10     3     33       40     0.000        0       0
2015-02 call     1188  4087   6279     1864     0.000      730       0
        data        0     0      0        0  1067.299        0       0
        sms         1     2     11       23     0.000        0       2
2015-03 call      274   973   4966     3513     0.000    11770       0
        data        0     0      0        0   998.441        0       0
        sms         0     4      5       13     0.000        0       0


network      voicemail world
month   item
2014-11 call       301     0
        data         0     0
        sms          0     0
2014-12 call       690     0
        data         0     0
        sms          0     4
2015-01 call       285     0
        data         0     0
        sms          0     0
2015-02 call       268     0
        data         0     0
        sms          0     0
2015-03 call       231     0
        data         0     0
        sms          0     3

In [151]:
# groupbyë¡œë„ ë¹„ìŠ·í•˜ê²Œ êµ¬í˜„í•  ìˆ˜ ìˆìŒ
df.groupby(["month", "item", "network"])["duration"].sum().unstack().fillna(0)

network       Meteor   Tesco    Three  Vodafone      data  landline  special  \
month   item
2014-11 call  1521.0  4045.0  12458.0    4316.0     0.000    2906.0      0.0
        data     0.0     0.0      0.0       0.0   998.441       0.0      0.0
        sms     10.0     3.0     25.0      55.0     0.000       0.0      1.0
2014-12 call  2010.0  1819.0   6316.0    1302.0     0.000    1424.0      0.0
        data     0.0     0.0      0.0       0.0  1032.870       0.0      0.0
        sms     12.0     1.0     13.0      18.0     0.000       0.0      0.0
2015-01 call  2207.0  2904.0   6445.0    3626.0     0.000    1603.0      0.0
        data     0.0     0.0      0.0       0.0  1067.299       0.0      0.0
        sms     10.0     3.0     33.0      40.0     0.000       0.0      0.0
2015-02 call  1188.0  4087.0   6279.0    1864.0     0.000     730.0      0.0
        data     0.0     0.0      0.0       0.0  1067.299       0.0      0.0
        sms      1.0     2.0     11.0      23.0     0.000       0.0      2.0
2015-03 call   274.0   973.0   4966.0    3513.0     0.000   11770.0      0.0
        data     0.0     0.0      0.0       0.0   998.441       0.0      0.0
        sms      0.0     4.0      5.0      13.0     0.000       0.0      0.0

network       voicemail  world
month   item
2014-11 call      301.0    0.0
        data        0.0    0.0
        sms         0.0    0.0
2014-12 call      690.0    0.0
        data        0.0    0.0
        sms         0.0    4.0
2015-01 call      285.0    0.0
        data        0.0    0.0
        sms         0.0    0.0
2015-02 call      268.0    0.0
        data        0.0    0.0
        sms         0.0    0.0
2015-03 call      231.0    0.0
        data        0.0    0.0
        sms         0.0    3.0

## 13. Crosstab
- **pivot í…Œì´ë¸”ì˜ íŠ¹ìˆ˜í•œ í˜•íƒœ**ì´ë‹¤. `index`ì™€ `columns`ì— ê°ê° í•˜ë‚˜ì˜ ì»¬ëŸ¼ë§Œ ë“¤ì–´ê°„ë‹¤.
- ë‘ ì»¬ëŸ¼ì— êµì°¨ ë¹ˆë„, ë¹„ìœ¨, ë§ì…ˆ ë“±ì„ êµ¬í•  ë•Œ ì‚¬ìš©í•œë‹¤.

In [152]:
df = pd.read_csv("./data/movie_rating.csv")
df.head()

          critic               title  rating
0  Jack Matthews   Lady in the Water     3.0
1  Jack Matthews   Snakes on a Plane     4.0
2  Jack Matthews   You Me and Dupree     3.5
3  Jack Matthews    Superman Returns     5.0
4  Jack Matthews  The Night Listener     3.0

In [156]:
pd.crosstab(
    index=df.critic,    # í…Œì´ë¸” ì¸ë±ìŠ¤ ì§€ì •
    columns=df.title,   # í…Œì´ë¸” ì»¬ëŸ¼ ì§€ì •
    values=df.rating,   # í…Œì´ë¸” ì¸ë±ìŠ¤ì™€ ì»¬ëŸ¼ìœ¼ë¡œ ë¶„ë¥˜í•  ì»¬ëŸ¼ ì§€ì •
    aggfunc="sum",      # ì ìš©í•  ì—°ì‚° ì§€ì •
).fillna(0)

title,Just My Luck,Lady in the Water,Snakes on a Plane,Superman Returns,The Night Listener,You Me and Dupree
critic,,,,,,
Claudia Puig,3.0,0.0,3.5,4.0,4.5,2.5
Gene Seymour,1.5,3.0,3.5,5.0,3.0,3.5
Jack Matthews,0.0,3.0,4.0,5.0,3.0,3.5
Lisa Rose,3.0,2.5,3.5,3.5,3.0,2.5
Mick LaSalle,2.0,3.0,4.0,3.0,3.0,2.0
Toby,0.0,0.0,4.5,4.0,0.0,1.0

## 14. merge
ë°ì´í„°í”„ë ˆì„ì˜ í¬ê¸°ê°€ ê°™ì§€ ì•Šì•„ë„ ë°ì´í„°ë¥¼ ë³‘í•©í•œë‹¤.

In [165]:
raw_data = {
    "subject_id": ["1", "2", "3", "4", "5", "7", "8", "9", "10", "11"],
    "test_score": [51, 15, 15, 61, 16, 14, 15, 1, 61, 16],
}
df_a = pd.DataFrame(raw_data, columns=["subject_id", "test_score"])
df_a

  subject_id  test_score
0          1          51
1          2          15
2          3          15
3          4          61
4          5          16
5          7          14
6          8          15
7          9           1
8         10          61
9         11          16

In [166]:
raw_data = {
    "subject_id": ["4", "5", "6", "7", "8"],
    "first_name": ["Billy", "Brian", "Bran", "Bryce", "Betty"],
    "last_name": ["Bonder", "Black", "Balwner", "Brice", "Btisan"],
}
df_b = pd.DataFrame(raw_data, columns=["subject_id", "first_name", "last_name"])
df_b

  subject_id first_name last_name
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

### 14.1. on, left_on, right_on - ê¸°ì¤€ ì»¬ëŸ¼ ì§€ì •

In [161]:
# ê³µí†µ ì»¬ëŸ¼ ì¤‘ ê³µí†µëœ ë°ì´í„°ë§Œ ë³‘í•©
pd.merge(df_a, df_b, on='subject_id')

  subject_id  test_score first_name last_name
0          4          61      Billy    Bonder
1          5          16      Brian     Black
2          7          14      Bryce     Brice
3          8          15      Betty    Btisan

In [162]:
# ê°™ì€ ì»¬ëŸ¼ì¸ë° ì´ë¦„ë§Œ ë‹¤ë¥¼ ê²½ìš° ì§ì ‘ ì§€ì • ê°€ëŠ¥
pd.merge(df_a, df_b, left_on='subject_id', right_on='subject_id')

  subject_id  test_score first_name last_name
0          4          61      Billy    Bonder
1          5          16      Brian     Black
2          7          14      Bryce     Brice
3          8          15      Betty    Btisan

### 14.2. join
![join ë©”ì„œë“œ](./img/join_method.png)

In [163]:
# left : ì™¼ìª½ì— ìˆëŠ” ë°ì´í„°ë¥¼ ê¸°ì¤€ìœ¼ë¡œ ë³‘í•©
pd.merge(df_a, df_b, on='subject_id', how='left')

  subject_id  test_score first_name last_name
0          1          51        NaN       NaN
1          2          15        NaN       NaN
2          3          15        NaN       NaN
3          4          61      Billy    Bonder
4          5          16      Brian     Black
5          7          14      Bryce     Brice
6          8          15      Betty    Btisan
7          9           1        NaN       NaN
8         10          61        NaN       NaN
9         11          16        NaN       NaN

In [164]:
# right : ì™¼ìª½ì— ìˆëŠ” ë°ì´í„°ë¥¼ ê¸°ì¤€ìœ¼ë¡œ ë³‘í•©
pd.merge(df_a, df_b, on='subject_id', how='right')

  subject_id  test_score first_name last_name
0          4        61.0      Billy    Bonder
1          5        16.0      Brian     Black
2          6         NaN       Bran   Balwner
3          7        14.0      Bryce     Brice
4          8        15.0      Betty    Btisan

In [167]:
# outer : ì–‘ìª½ ë°ì´í„° ëª¨ë‘ë¥¼ ì‚´ë ¤ ë³‘í•©
pd.merge(df_a, df_b, on='subject_id', how='outer')

   subject_id  test_score first_name last_name
0           1        51.0        NaN       NaN
1           2        15.0        NaN       NaN
2           3        15.0        NaN       NaN
3           4        61.0      Billy    Bonder
4           5        16.0      Brian     Black
5           7        14.0      Bryce     Brice
6           8        15.0      Betty    Btisan
7           9         1.0        NaN       NaN
8          10        61.0        NaN       NaN
9          11        16.0        NaN       NaN
10          6         NaN       Bran   Balwner

In [168]:
# inner : ì„œë¡œ ê³µí†µëœ ë°ì´í„°ë§Œ ê°€ì§€ê³  ë³‘í•© (default)
pd.merge(df_a, df_b, on='subject_id', how='inner')

  subject_id  test_score first_name last_name
0          4          61      Billy    Bonder
1          5          16      Brian     Black
2          7          14      Bryce     Brice
3          8          15      Betty    Btisan

### 14.3. right_index, left_index

In [170]:
# ê¸°ì¤€ ì»¬ëŸ¼ì„ ì–‘ ìª½ ë°ì´í„°í”„ë ˆì„ ëª¨ë‘ ì‚´ë¦¬ê³  ì‹¶ì„ ë•Œ
pd.merge(df_a, df_b, right_index=True, left_index=True)

  subject_id_x  test_score subject_id_y first_name last_name
0            1          51            4      Billy    Bonder
1            2          15            5      Brian     Black
2            3          15            6       Bran   Balwner
3            4          61            7      Bryce     Brice
4            5          16            8      Betty    Btisan

## 15. concat
ì»¬ëŸ¼ì´ ëª¨ë‘ ê°™ì€ ë°ì´í„°ë¥¼ ë³‘í•©í•œë‹¤.

In [172]:
raw_data = {
    "subject_id": ["1", "2", "3", "4", "5"],
    "first_name": ["Alex", "Amy", "Allen", "Alice", "Ayoung"],
    "last_name": ["Anderson", "Ackerman", "Ali", "Aoni", "Atiches"],
}
df_a = pd.DataFrame(raw_data, columns=["subject_id", "first_name", "last_name"])
df_a

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches

In [173]:
raw_data = {
    "subject_id": ["4", "5", "6", "7", "8"],
    "first_name": ["Billy", "Brian", "Bran", "Bryce", "Betty"],
    "last_name": ["Bonder", "Black", "Balwner", "Brice", "Btisan"],
}
df_b = pd.DataFrame(raw_data, columns=["subject_id", "first_name", "last_name"])
df_b

  subject_id first_name last_name
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

In [177]:
# df_a ì•„ë˜ df_b ë°ì´í„°ê°€ ë¶™ëŠ”ë‹¤
df_concated = pd.concat([df_a, df_b])
df_concated.reset_index()

   index subject_id first_name last_name
0      0          1       Alex  Anderson
1      1          2        Amy  Ackerman
2      2          3      Allen       Ali
3      3          4      Alice      Aoni
4      4          5     Ayoung   Atiches
5      0          4      Billy    Bonder
6      1          5      Brian     Black
7      2          6       Bran   Balwner
8      3          7      Bryce     Brice
9      4          8      Betty    Btisan

In [179]:
# appendë¥¼ ì“°ë©´ concat(axis=0)ê³¼ ê°™ì€ ë™ì‘ì„ ìˆ˜í–‰
df_a.append(df_b).reset_index()

   index subject_id first_name last_name
0      0          1       Alex  Anderson
1      1          2        Amy  Ackerman
2      2          3      Allen       Ali
3      3          4      Alice      Aoni
4      4          5     Ayoung   Atiches
5      0          4      Billy    Bonder
6      1          5      Brian     Black
7      2          6       Bran   Balwner
8      3          7      Bryce     Brice
9      4          8      Betty    Btisan

In [180]:
# axisë¥¼ ì§€ì •í•˜ì—¬ concatí•  ìˆ˜ ìˆìŒ
# ê¸°ë³¸ì€ 0ì´ë©°, axis=0ì€ ë¡œìš°, axis=1ì€ ì»¬ëŸ¼
df_concated_axis_1 = pd.concat([df_a, df_b], axis=1)
df_concated_axis_1.reset_index()

   index subject_id first_name last_name subject_id first_name last_name
0      0          1       Alex  Anderson          4      Billy    Bonder
1      1          2        Amy  Ackerman          5      Brian     Black
2      2          3      Allen       Ali          6       Bran   Balwner
3      3          4      Alice      Aoni          7      Bryce     Brice
4      4          5     Ayoung   Atiches          8      Betty    Btisan

## 16. Dataframe to pickle

In [182]:
# pickleë¡œ ì €ì¥
df.to_pickle('./data/save_test.pickle')
df.head()

          critic               title  rating
0  Jack Matthews   Lady in the Water     3.0
1  Jack Matthews   Snakes on a Plane     4.0
2  Jack Matthews   You Me and Dupree     3.5
3  Jack Matthews    Superman Returns     5.0
4  Jack Matthews  The Night Listener     3.0

In [183]:
# pickleíŒŒì¼ ë¡œë“œ
df_pickle = pd.read_pickle('./data/save_test.pickle')
df_pickle.head()

          critic               title  rating
0  Jack Matthews   Lady in the Water     3.0
1  Jack Matthews   Snakes on a Plane     4.0
2  Jack Matthews   You Me and Dupree     3.5
3  Jack Matthews    Superman Returns     5.0
4  Jack Matthews  The Night Listener     3.0